#### PostPattern Members

---

|  |
| --- |
| PostPattern Class   Methods   Properties   See Also |

The  PostPattern  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | Releases all resources used by the  PostPattern |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | CornerPost | Accesses the object containing properties related to the corner post. |
| Public property | CornerPostAngle | The angle between neighboring railing segments which conditions inserting post along a railing path. |
| Public property | CornerPostCondition | The condition which controls the insertion of corner posts. |
| Public property | EndPost | Accesses the object containing properties related to the end post. |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| Public property | StartPost | Accesses the object containing properties related to the start post. |

# See Also

PostPattern Class

Autodesk.Revit.DB.Architecture Namespace